test/wrk2_fission/c_fanout/result/pthread_5.log
Running 1m test @ http://130.127.133.16:32241
  1 threads and 1 connections
  Thread calibration: mean lat.: 5027.961ms, rate sampling interval: 17989ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.95s    14.43s    1.00m    57.87%
    Req/Sec    20.00      0.00    20.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.96s 
 75.000%   47.38s 
 90.000%    0.92m 
 99.000%    0.99m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10027.007     0.000000            1         1.00
   14958.591     0.100000          101         1.11
   19955.711     0.200000          201         1.25
   24985.599     0.300000          302         1.43
   29933.567     0.400000          402         1.67
   34963.455     0.500000          502         2.00
   37486.591     0.550000          553         2.22
   39976.959     0.600000          603         2.50
   42434.559     0.650000          653         2.86
   44892.159     0.700000          703         3.33
   47382.527     0.750000          753         4.00
   48693.247     0.775000          779         4.44
   49971.199     0.800000          804         5.00
   51216.383     0.825000          829         5.71
   52494.335     0.850000          854         6.67
   53739.519     0.875000          879         8.00
   54394.879     0.887500          892         8.89
   54984.703     0.900000          904        10.00
   55640.063     0.912500          917        11.43
   56229.887     0.925000          929        13.33
   56885.247     0.937500          942        16.00
   57180.159     0.943750          948        17.78
   57475.071     0.950000          954        20.00
   57835.519     0.956250          961        22.86
   58130.431     0.962500          967        26.67
   58425.343     0.968750          973        32.00
   58589.183     0.971875          976        35.56
   58720.255     0.975000          979        40.00
   58916.863     0.978125          983        45.71
   59080.703     0.981250          986        53.33
   59244.543     0.984375          989        64.00
   59277.311     0.985938          990        71.11
   59375.615     0.987500          992        80.00
   59473.919     0.989062          994        91.43
   59539.455     0.990625          995       106.67
   59637.759     0.992188          997       128.00
   59637.759     0.992969          997       142.22
   59703.295     0.993750          998       160.00
   59736.063     0.994531          999       182.86
   59801.599     0.995313         1000       213.33
   59834.367     0.996094         1001       256.00
   59834.367     0.996484         1001       284.44
   59834.367     0.996875         1001       320.00
   59899.903     0.997266         1002       365.71
   59899.903     0.997656         1002       426.67
   59932.671     0.998047         1003       512.00
   59932.671     0.998242         1003       568.89
   59932.671     0.998437         1003       640.00
   59932.671     0.998633         1003       731.43
   59932.671     0.998828         1003       853.33
   59998.207     0.999023         1004      1024.00
   59998.207     1.000000         1004          inf
#[Mean    =    34950.568, StdDeviation   =    14430.839]
#[Max     =    59965.440, Total count    =         1004]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   49.02ms
 75.000%   49.66ms
 90.000%   50.21ms
 99.000%   55.58ms
 99.900%   69.38ms
 99.990%   81.02ms
 99.999%   81.02ms
100.000%   81.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      47.455     0.000000            2         1.00
      48.191     0.100000          103         1.11
      48.415     0.200000          205         1.25
      48.607     0.300000          307         1.43
      48.799     0.400000          403         1.67
      49.023     0.500000          513         2.00
      49.151     0.550000          563         2.22
      49.247     0.600000          607         2.50
      49.375     0.650000          663         2.86
      49.503     0.700000          705         3.33
      49.663     0.750000          755         4.00
      49.759     0.775000          782         4.44
      49.855     0.800000          808         5.00
      49.951     0.825000          831         5.71
      50.047     0.850000          863         6.67
      50.143     0.875000          887         8.00
      50.175     0.887500          894         8.89
      50.207     0.900000          905        10.00
      50.367     0.912500          919        11.43
      50.463     0.925000          934        13.33
      50.527     0.937500          944        16.00
      50.591     0.943750          949        17.78
      50.655     0.950000          954        20.00
      50.815     0.956250          962        22.86
      50.911     0.962500          968        26.67
      51.039     0.968750          975        32.00
      51.071     0.971875          976        35.56
      51.327     0.975000          980        40.00
      51.455     0.978125          983        45.71
      51.871     0.981250          986        53.33
      52.959     0.984375          989        64.00
      53.023     0.985938          991        71.11
      53.055     0.987500          992        80.00
      55.583     0.989062          994        91.43
      56.127     0.990625          995       106.67
      58.527     0.992188          997       128.00
      58.527     0.992969          997       142.22
      61.279     0.993750          998       160.00
      61.343     0.994531          999       182.86
      62.815     0.995313         1000       213.33
      68.543     0.996094         1001       256.00
      68.543     0.996484         1001       284.44
      68.543     0.996875         1001       320.00
      69.247     0.997266         1002       365.71
      69.247     0.997656         1002       426.67
      69.375     0.998047         1003       512.00
      69.375     0.998242         1003       568.89
      69.375     0.998437         1003       640.00
      69.375     0.998633         1003       731.43
      69.375     0.998828         1003       853.33
      81.023     0.999023         1004      1024.00
      81.023     1.000000         1004          inf
#[Mean    =       49.279, StdDeviation   =        1.903]
#[Max     =       80.960, Total count    =         1004]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1205 requests in 1.00m, 368.33KB read
Requests/sec:     20.08
Transfer/sec:      6.14KB