test/wrk2_fission/c_fanout/result/pthread_threshold_13.log
Running 1m test @ http://130.127.133.16:32241
  1 threads and 1 connections
  Thread calibration: mean lat.: 5034.725ms, rate sampling interval: 17973ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.35s    14.21s    0.99m    58.23%
    Req/Sec    15.00      0.00    15.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.18s 
 75.000%   46.40s 
 90.000%    0.91m 
 99.000%    0.98m 
 99.900%    0.99m 
 99.990%    0.99m 
 99.999%    0.99m 
100.000%    0.99m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10059.775     0.000000            1         1.00
   14802.943     0.100000           75         1.11
   19628.031     0.200000          150         1.25
   24494.079     0.300000          225         1.43
   29278.207     0.400000          299         1.67
   34177.023     0.500000          374         2.00
   36601.855     0.550000          411         2.22
   39157.759     0.600000          449         2.50
   41582.591     0.650000          486         2.86
   44007.423     0.700000          523         3.33
   46465.023     0.750000          561         4.00
   47611.903     0.775000          579         4.44
   48857.087     0.800000          598         5.00
   50135.039     0.825000          617         5.71
   51904.511     0.850000          635         6.67
   53149.695     0.875000          654         8.00
   53739.519     0.887500          663         8.89
   54394.879     0.900000          673        10.00
   54951.935     0.912500          682        11.43
   55574.527     0.925000          691        13.33
   56262.655     0.937500          701        16.00
   56524.799     0.943750          705        17.78
   56852.479     0.950000          710        20.00
   57180.159     0.956250          715        22.86
   57442.303     0.962500          719        26.67
   57769.983     0.968750          724        32.00
   57901.055     0.971875          726        35.56
   58097.663     0.975000          729        40.00
   58228.735     0.978125          731        45.71
   58359.807     0.981250          733        53.33
   58556.415     0.984375          736        64.00
   58621.951     0.985938          737        71.11
   58687.487     0.987500          738        80.00
   58753.023     0.989062          739        91.43
   58818.559     0.990625          740       106.67
   58949.631     0.992188          742       128.00
   58949.631     0.992969          742       142.22
   59015.167     0.993750          743       160.00
   59015.167     0.994531          743       182.86
   59080.703     0.995313          744       213.33
   59146.239     0.996094          745       256.00
   59146.239     0.996484          745       284.44
   59146.239     0.996875          745       320.00
   59146.239     0.997266          745       365.71
   59211.775     0.997656          746       426.67
   59211.775     0.998047          746       512.00
   59211.775     0.998242          746       568.89
   59211.775     0.998437          746       640.00
   59211.775     0.998633          746       731.43
   59277.311     0.998828          747       853.33
   59277.311     1.000000          747          inf
#[Mean    =    34348.985, StdDeviation   =    14208.759]
#[Max     =    59244.544, Total count    =          747]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   63.36ms
 75.000%   67.33ms
 90.000%   70.27ms
 99.000%   77.31ms
 99.900%   98.11ms
 99.990%  665.09ms
 99.999%  665.09ms
100.000%  665.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      58.975     0.000000            1         1.00
      61.087     0.100000           76         1.11
      61.695     0.200000          150         1.25
      62.239     0.300000          228         1.43
      62.751     0.400000          305         1.67
      63.359     0.500000          375         2.00
      63.807     0.550000          412         2.22
      64.191     0.600000          449         2.50
      64.767     0.650000          487         2.86
      65.663     0.700000          524         3.33
      67.327     0.750000          563         4.00
      67.967     0.775000          579         4.44
      68.799     0.800000          599         5.00
      69.311     0.825000          618         5.71
      69.631     0.850000          638         6.67
      69.951     0.875000          654         8.00
      70.143     0.887500          667         8.89
      70.271     0.900000          673        10.00
      70.591     0.912500          683        11.43
      70.719     0.925000          694        13.33
      70.975     0.937500          703        16.00
      71.103     0.943750          705        17.78
      71.359     0.950000          711        20.00
      71.551     0.956250          717        22.86
      71.935     0.962500          720        26.67
      72.255     0.968750          724        32.00
      72.511     0.971875          726        35.56
      72.767     0.975000          729        40.00
      73.215     0.978125          731        45.71
      73.407     0.981250          733        53.33
      74.943     0.984375          736        64.00
      75.327     0.985938          737        71.11
      75.391     0.987500          738        80.00
      76.543     0.989062          739        91.43
      77.311     0.990625          741       106.67
      79.615     0.992188          742       128.00
      79.615     0.992969          742       142.22
      79.743     0.993750          743       160.00
      79.743     0.994531          743       182.86
      80.703     0.995313          744       213.33
      90.879     0.996094          745       256.00
      90.879     0.996484          745       284.44
      90.879     0.996875          745       320.00
      90.879     0.997266          745       365.71
      98.111     0.997656          746       426.67
      98.111     0.998047          746       512.00
      98.111     0.998242          746       568.89
      98.111     0.998437          746       640.00
      98.111     0.998633          746       731.43
     665.087     0.998828          747       853.33
     665.087     1.000000          747          inf
#[Mean    =       65.531, StdDeviation   =       22.301]
#[Max     =      664.576, Total count    =          747]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  903 requests in 1.00m, 535.27KB read
Requests/sec:     15.05
Transfer/sec:      8.92KB